Revit 2027 API
IPointCloudAccess.GetName Method
 Implement this method to return the name of the point cloud that will be used when Revit needs to refer to the point cloud type, e.g. in the Manage Links dialog or in the Type Properties dialog.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
string GetName()
Function GetName As String
String^ GetName()
abstract GetName : unit -> string
Return Value
String
 The name of the point cloud for Revit's user interface.
See Also
Reference
IPointCloudAccess Interface
Autodesk.Revit.DB.PointClouds Namespace